# Introduction to SQL Queries

# Pair Programming Exercise for DSE5002
HD Sheets,  Feb. 5 2025

We will connect to the chinook database and work through some *queries*

The slang term for this is *pulling data from the database*

These are queries made to a single table, we will see later how to join tables together and create subqueries

The commands used in queries are:

SELECT --specify the variables or columns required

FROM--specify the table to obtain data from 

LIMIT-- restrict the number of lines returned to a desired total N

WHERE-- this is a filtering function carried out on row elements,  we can use AND, OR and NOT within the Where

ORDER BY-- This is a sorting function,   it can sortascending or descending, and we can sort on multiple variables

GROUP BY--this is a grouping function

HAVING--Having is a filtering operation on group members

MAX(), MIN(), AVG(), SUM(), COUNT() are aggregating functions used with GROUP BY,  


These are the available commands in SQL that we use in combination to create queries.  We can do the same types of data slicing, sorting, filtering ect that we do in R or Python dataframes in SQL.

While the names are different, the actions appear in the TidyVerse library in R and in the Polars library in Python.   Polars is an alternative to Pandas and has some advantages over Pandas with working with large data sets,   and it's query system is almost identical to SQL,  which is an advantage.

# Source material

"Learning SQL", Beaulieu,  O'Reilly 2005

https://www.sqlitetutorial.net/   - explains queries using the chinook database, albeit in the SQLite database system.  The SELECT system used for queries is pretty standard for most SQL databases,   the other aspects and commands seem to be a bit more variable from one server program to another.

That said, there are minor differences in variable names between the chinook database in postgres and the tutorial for SQlite,   watch for underscores and pluralization (track vs tracks, etc).   I have fixed all the examples shown here.

# Connect to the Chinook Database

and figure out what we have in it


Set up the required libraries

In [ ]:
#import psycopg2
import sqlalchemy

# we will want Pandas for the data frame structure

import pandas as pd

In [ ]:
# Alter this to reflect your username and password,   this is for postgres on the same machine

# if you are using the default installation of Postgress and the databases for the course DSE5002, this 
# command should work fine for the user bob whose password is pwd1

engine=sqlalchemy.create_engine('postgresql://bob:pwd1@localhost:5432/chinook')

In [ ]:
pd.__version__

# what tables do we have

We can use a SELECT command to look for the table_name values in a built-in database called information_schema,  in a table called tables.  
This is a database and table that are built into postgres to hold information.   It holds a lot of info, but our table names are all in the first 15 lines

In [ ]:
pd.read_sql_query("SELECT table_name  FROM information_schema.tables LIMIT 15",engine)

In [ ]:
# Looking at the customer table, but only first 5 rows

pd.read_sql_query("SELECT * FROM customer LIMIT 5",engine)

In [ ]:
#restrict this to only customer_id, first and last names


pd.read_sql_query("SELECT customer_id, first_name, last_name FROM customer LIMIT 8",engine)

# *QUESTION/ACTION*

Figure out what the table "invoices" looks like,  display the first 5 lines of it so you can see the content

In [ ]:
pd.read_sql_query("--add your query here ---",engine)

# *Question/Action*

Show the variables customer_id,  billing_country and total for the first 12 lines of invoice

# Ordering or Sorting Results

In [ ]:
pd.read_sql_query("SELECT * FROM track ORDER BY Milliseconds LIMIT 12",engine)

In [ ]:
# reversed order sort

# add DESC to sort descending, ASC to sort ascending

pd.read_sql_query("SELECT * FROM track ORDER BY Milliseconds DESC LIMIT 12",engine)

In [ ]:
# sort by two variables

pd.read_sql_query("SELECT * FROM track ORDER BY composer ASC, milliseconds DESC LIMIT 12",engine)

# *Question/Action*

Sort invoices by billing_city (ascending) and total purchase (descending),  show the invoice_id, billing_city and total

In [ ]:
pd.read_sql_query("--add your query here ---",engine)

# Distinct

Selects only the unique values of a variable

In [ ]:
# look at the Distinct cities in our customer list

pd.read_sql_query("""SELECT DISTINCT city 
                    FROM customer
                    ORDER BY city
                    LIMIT 20;"""
                     ,engine)

# *Question/Action*

Find the list of distinct artists listed in Track,   sort them

# Where

Where is a filter that allows us to filter out only the rows that meet some desired condition.  

Notice that the select command itself allows us to control the columns show, Where works on the rows

# Comparison Operators

=,   !=,  <, >, >=, <=                 *Note equality is a single equal sign in postgres "="

# Logical Operators

AND, NOT, OR

# Other tests

ALL- 1 if all expressions are 1

ANY- 1 if any expressions is 1

BETWEEN- tests for a range of values

IN- comparison to a list of values

LIKE- used on strings, if they match a pattern

In [ ]:
# we can select as specific album id for the tracks 

pd.read_sql_query("""SELECT name, milliseconds,bytes,album_id
                     FROM track
                     WHERE album_id=6""", engine)

In [ ]:
# we can select as specific album id for the tracks and restrict to relatively short tracks

pd.read_sql_query("""SELECT name, milliseconds,bytes,album_id
                     FROM track
                     WHERE album_id=6 AND milliseconds<250000""", engine)

In [ ]:
# *Question/Action*

Find out how many invoices totals where over 25

# LIKE

In [ ]:
# The Like operator,  allows partial text matching

# note the use of the doubled percent signs %%
# also note that this is case sensitive

pd.read_sql_query("""SELECT name, album_id, composer 
                     FROM track
                     WHERE composer LIKE '%%Smith%%'""",engine)

In [ ]:
# *Question/Action*

Use the LIKE function to find all the invoice entries from Ireland

be sure to use LIKE,   the = test would work here too, but practice using LIKE

# IN

Tests for membership in a list

Also filtering out one AC/DC album using AND NOT combined with LIKE

In [ ]:
pd.read_sql_query("""SELECT
                        name,
                        album_id,
                        media_type_id
                    FROM
                        track
                    WHERE
                        media_type_id IN (2, 3) AND NOT(name LIKE '%%Wall%%');""",engine)

# AND

In [ ]:
pd.read_sql_query("""SELECT
                      billing_address,
                      billing_city,
                      total
                    FROM
                      invoice
                    WHERE
                      billing_city= 'New York'
                    AND total > 5
                    ORDER BY
                      total;""",engine)

In [ ]:
pd.read_sql_query("""SELECT * FROM invoice LIMIT 5""",engine)

# OR

Using AND and OR together

In [ ]:
pd.read_sql_query("""SELECT
                      billing_address,
                      billing_city,
                      total
                    FROM
                      invoice
                    WHERE
                      (billing_city= 'New York' OR billing_city= 'Chicago')
                    AND total > 5
                    ORDER BY
                      total;""",engine)

# BETWEEN

Looks for a range of values

In [ ]:
pd.read_sql_query("""SELECT
                        invoice_id,
                        billing_address,
                        total
                    FROM
                        invoice
                    WHERE
                        total BETWEEN 14.91 and 18.86    
                    ORDER BY
                        total; """,engine)

In [ ]:
#NOT BETWEEN
#
# excluding a range


pd.read_sql_query("""SELECT
                        invoice_id,
                        billing_address,
                        total
                    FROM
                        invoice
                    WHERE
                        total NOT BETWEEN 1 and 20    
                    ORDER BY
                        total; """,engine)

In [ ]:
# shut down the engine to close the connection

engine.dispose()

In [ ]:
engine.